---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Mechanical.MechanicalUtils
source: html/135d54ad-b8f4-3fe9-e813-312ee092b525.htm
---
# MechanicalUtils Members

Breaks the duct curve into two parts at the given position.